HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F7xx_DFP.2.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F7xx_DFP</name>
  <description>STMicroelectronics STM32F7 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.4.0" date="2016-01-27">
      Updated STM32Cube_FW_F7 Firmware Package:
      - updated to version V1.3.0
      - updated HAL to version V1.0.4
      CMSIS Driver:
      - USB Device:
      -- updated Isochronous transfer
      - USB Host:
      -- interrupt priority handling removed from driver
      -- added DMA support to high-speed port driver reducing CPU load (enabled by default)
      -- renamed externally overridable setting for maximum number of pipes used
         from USBH_MAX_PIPE_NUM to USBH0_MAX_PIPE_NUM for full-speed driver, and
         from USBH_MAX_PIPE_NUM to USBH1_MAX_PIPE_NUM for high-speed driver
      -- corrected speed setting for On-chip Full-speed PHY for high-speed port
      - CAN: corrected functionality when only one CAN controller is used
      - SAI: corrected configuration for receive DMA, synchronization and FRC register
      - I2C:
      -- MasterReceive function corrected when receiving without restart condition
      -- corrected ARM_I2C_GetDataCount and ARM_I2C_SignalEvent behavior when stop detected
      - USART: added the clearing of noise detection flag
      Board Support STM32F746G-Discovery and STM32F756G-EVAL:
      - Added Network examples using DualStack (IPv4/IPv6) Middleware (Keil.MDK-Middleware.7.0.0.pack required)
      - Added Audio Board Interfaces
      - Added USB Device Audio examples
    </release>
    <release version="2.3.0" date="2015-10-23">
      MDK-ARM configuration via STM32CubeMX:
      - Updated MX_Device.h generation: pin names characters '/', '-', ' ' converted to '_'
      Added Flash Programming Algorithm for external Flash on 32F746G-DISCOVERY board
      Added CMSIS Driver for CAN
      - Extended RTE_Device.h
      - Added Examples CAN Data and CAN RTR for STMicroelectronics STM32756G-EVAL Board
      Updated CMSIS drivers:
      - all: Corrected PowerControl function for Unconditional Power Off
      - EMAC: Corrected return value of the ReadFrame function
      - I2C: Corrected setting of own address
      - MCI: Removed clock power save bit handling from ARM_MCI_BUS_SPEED control
      - USB Device:  Updated procedure for IN Endpoint FIFO flush
      - USB Host: Corrected multiple packet sending and PING functionality
      - SPI: Corrected 8bit/16bit Data register access, regarding the Data frame size
      - SPI: Corrected pin configuration (for RTE_SPI2_NSS_PIN and MX_SPI3_MOSI_Pin) in SPI_STM32F7xx.h
      Updated emWin GUIDemo examples (added MPU configuration)
    </release>
    <release version="2.2.0" date="2015-09-04">
      Introducing project creation with MDK and STM32Cube (STM32Cube HAL and STM32CubeMX):
      - Added STM32CubeMxLauncher (uVision launcher for STM32CubeMX configuration utility)
      - Added documentation for creating projects with MDK and STM32Cube
      - Added project examples created with MDK and STM32Cube:
      -- Blinky for ST Microelectronics STM32F746G-Discovery
      -- emWin GUI_VNC for ST Microelectronics STM32F746G-Discovery
      - Enhanced CMSIS drivers compatibility with STM32CubeMX
      Updated CMSIS drivers:
      - EMAC: Corrected lockup after long runtime
    </release>
    <release version="2.1.0" date="2015-07-31">
      Added CMSIS-Driver for I2C and SAI
      Updated RTE_Device.h (Ver 1.1.0) adding the SAI driver configurations for SAI1 and SAI2
      Extended File_Demo example (NOR flash drive F0 enabled)
      Extended template file "main.c" with provisions for using CMSIS-RTOS RTX
      Corrected CMSIS Driver USART: The driver incorrectly stopped receiving data when calling the USART_Receive function while the receiver is busy
    </release>
    <release version="2.0.0" date="2015-07-16">
      This PACK requires Keil.MDK-Middleware.6.5.0.pack to be the latest version installed
      Integrates STMicroelectronics STM32CubeF7 Firmware Package V1.1.0
      Added CMSIS-Driver for Ethernet MAC, MCI, SPI, USART, USB Device and USB Host
      Added Board support and MDK-Middleware Examples for ST Microelectronics STM32F746G-Discovery
      - FileSystem, Network, USB Device/Host and emWin
      Added Board support and MDK-Middleware Examples for ST Microelectronics STM32756G-EVAL
      - FileSystem, Network, USB Device/Host and emWin
      Added OTP, OPT Flash Algorithms and templates
      Updated Flash Algorithm
    </release>
    <release version="1.2.0" date="2015-06-26">
      Increased timeout for Sector Erase in Flash Algorithms.
      RAMsize for Flash Algorithm corrected
      Replicated Flash Algorithms for project backward compatibility
    </release>
    <release version="1.1.0" date="2015-06-22">
      Added Flash Algorithm for external flash memory to be used with the STM32756G-EVAL Board
    </release>
    <release version="1.0.0" date="2015-06-12">
      Initial version of STM32F7 Device Family Pack.
      STM32F756, STM32F745, STM32F746 sub families
      - Device description and Startup component
      - Flash Programming Algorithms for Flash and ITCM
      - System View Description file
      - Documentation
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F7</keyword>
    <keyword>STM32F7xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F7 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="216000000" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian"/>
      <book name="Documentation/DM00189702.pdf" title="STM32F7xx HAL Drivers"/>
      <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_QSPI_Micron.flm" start="0x90000000" size="0x04000000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
      <algorithm name="CMSIS/Flash/STM32F7xx_QSPI_Disco.FLM"  start="0x90000000" size="0x01000000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
      <algorithm name="CMSIS/Flash/STM32F7xx_OPT.FLM"         start="0x1FFF0000" size="0x08"       RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"         start="0x1FF0F000" size="0x0410"     RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <debug svd="CMSIS/SVD/STM32F7x.svd"/>

      <debugvars>
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
        __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
      </debugvars>

