HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F7xx_DFP.2.4.0.pdsc
      <sequences>

        <!-- Override for Pre-Defined DebugCoreStart Sequence -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0042004, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0xE0042008, DbgMCU_APB1_Fz);                                    // DBGMCU_APB1_FZ: Configure APB1 Peripheral Freeze Behavior
            Write32(0xE004200C, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <!-- User-Defined EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            __var dbgmcu_val    = 0;                                                // DBGMCU_CR Value
            __var rcc_ahb1enr   = 0;                                                // RCC_AHB1ENR Value
            __var gpiob_moder   = 0;                                                // GPIOB_MODER Value
            __var gpiob_ospeedr = 0;                                                // GPIOB_OSPEEDR Value
            __var gpiob_pupdr   = 0;                                                // GPIOB_PUPDR Value
            __var gpiob_afrl    = 0;                                                // GPIOB_AFRL Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CR and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable + Trace Mode Asynchronous

            rcc_ahb1enr   = (Read32(0x40023830) | 0x00000002);                      // RCC_AHB1ENR: IO port B clock enable
            gpiob_moder   = (Read32(0x40020400) &amp; (~0x000000C0)) | 0x00000080;  // GPIOB_MODER: Set PB3 Mode (Alternate Function)
            gpiob_ospeedr = (Read32(0x40020408) | 0x000000C0);                      // GPIOB_OSPEEDR: Set PB3 Speed (High Speed)
            gpiob_pupdr   = (Read32(0x4002040C) &amp; (~0x000000C0));               // GPIOB_PUPDR: Set PB3 I/O to no pull-up/pull-down
            gpiob_afrl    = (Read32(0x40020420) &amp; (~0x0000F000));               // GPIOB_AFRL: Set PB3 Alternate Function to AF0 (SWO)

            Write32(0x40023830, rcc_ahb1enr);                                       // Write RCC_AHB1ENR
            Write32(0x40020400, gpiob_moder);                                       // Write GPIOB_MODER
            Write32(0x40020408, gpiob_ospeedr);                                     // Write GPIOB_OSPEEDR
            Write32(0x4002040C, gpiob_pupdr);                                       // Write GPIOB_PUPDR
            Write32(0x40020420, gpiob_afrl);                                        // Write GPIOB_AFRL
            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CR: Trace Settings
          </block>
        </sequence>

        <!-- User-Defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var width         = (__traceout &amp; 0x003F0000) &gt;&gt; 16;        // TPIU Port Width
            __var dbgmcu_val    = 0;                                                // DBGMCU_CR Value
            __var rcc_ahb1enr   = 0;                                                // RCC_AHB1ENR Value
            __var gpioe_moder   = 0;                                                // GPIOE_MODER Value
            __var gpioe_ospeedr = 0;                                                // GPIOE_OSPEEDR Value
            __var gpioe_pupdr   = 0;                                                // GPIOE_PUPDR Value
            __var gpioe_afrl    = 0;                                                // GPIOE_AFRL Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CR and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable

            // TRACECK Setup
            rcc_ahb1enr   = (Read32(0x40023830) | 0x00000010);                      // RCC_AHB1ENR: IO port E clock enable
            gpioe_moder   = (Read32(0x40021000) &amp; (~0x00000030)) | 0x00000020;  // GPIOE_MODER: Set PE2 Mode (Alternate Function)
            gpioe_ospeedr = (Read32(0x40021008) | 0x00000030);                      // GPIOE_OSPEEDR: Set PE2 Speed (High Speed)
            gpioe_pupdr   = (Read32(0x4002100C) &amp; (~0x00000030));               // GPIOE_PUPDR: Set PE2 I/O to no pull-up/pull-down
            gpioe_afrl    = (Read32(0x40021020) &amp; (~0x00000F00));               // GPIOE_AFRL: Set PE2 Alternate Function to AF0 (TRACECK)
          </block>

          <control if="width == 1">
            <block>
              // 1-Bit TPIU Trace Setup
              dbgmcu_val    |= (1 &lt;&lt; 6);                                      // Trace Mode (1-Bit)
              gpioe_moder    = (gpioe_moder &amp; (~0x000000C0)) | 0x00000080;      // GPIOE_MODER: Set PE3 Mode (Alternate Function)
              gpioe_ospeedr  = (gpioe_ospeedr | 0x000000C0);                        // GPIOE_OSPEEDR: Set PE3 Speed (High Speed)
              gpioe_pupdr    = (gpioe_pupdr &amp; (~0x000000C0));                   // GPIOE_PUPDR: Set PE3 I/O to no pull-up/pull-down
              gpioe_afrl     = (gpioe_afrl  &amp; (~0x0000F000));                   // GPIOE_AFRL: Set PE3 Alternate Function to AF0 (TRACED[0])
            </block>
          </control>

          <control if="width == 2">
            <block>
              // 2-Bit TPIU Trace Setup
              dbgmcu_val    |= (2 &lt;&lt; 6);                                      // Trace Mode (2-Bit)
              gpioe_moder    = (gpioe_moder &amp; (~0x000003C0)) | 0x00000280;      // GPIOE_MODER: Set PE3+PE4 Mode (Alternate Function)
              gpioe_ospeedr  = (gpioe_ospeedr | 0x000003C0);                        // GPIOE_OSPEEDR: Set PE3+PE4 Speed (High Speed)
              gpioe_pupdr    = (gpioe_pupdr &amp; (~0x000003C0));                   // GPIOE_PUPDR: Set PE3+PE4 I/O to no pull-up/pull-down
              gpioe_afrl     = (gpioe_afrl  &amp; (~0x000FF000));                   // GPIOE_AFRL: Set PE3+PE4 Alternate Function to AF0 (TRACED[0..1])
            </block>
          </control>

          <control if="width == 4">
            <block>
              // 4-Bit TPIU Trace Setup
              dbgmcu_val    |= (3 &lt;&lt; 6);                                      // Trace Mode (4-Bit)
              gpioe_moder    = (gpioe_moder &amp; (~0x00003FC0)) | 0x00002A80;      // GPIOE_MODER: Set PE3+PE4+PE5+PE6 Mode (Alternate Function)
              gpioe_ospeedr  = (gpioe_ospeedr | 0x00003FC0);                        // GPIOE_OSPEEDR: Set PE3+PE4+PE5+PE6 Speed (High Speed)
              gpioe_pupdr    = (gpioe_pupdr &amp; (~0x00003FC0));                   // GPIOE_PUPDR: Set PE3+PE4+PE5+PE6 I/O to no pull-up/pull-down
              gpioe_afrl     = (gpioe_afrl  &amp; (~0x0FFFF000));                   // GPIOE_AFRL: Set PE3+PE4+PE5+PE6 Alternate Function to AF0 (TRACED[0..3])
            </block>
          </control>

          <block>
            // Write Trace Configuration to Target
            Write32(0x40023830, rcc_ahb1enr);                                       // Write RCC_AHB1ENR
            Write32(0x40021000, gpioe_moder);                                       // Write GPIOE_MODER
            Write32(0x40021008, gpioe_ospeedr);                                     // Write GPIOE_OSPEEDR
            Write32(0x4002100C, gpioe_pupdr);                                       // Write GPIOE_PUPDR
            Write32(0x40021020, gpioe_afrl);                                        // Write GPIOE_AFRL
            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CR: Trace Settings
          </block>

        </sequence>

