HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F7xx_DFP.2.4.0.pdsc
      </sequences>

      <description>
The STM32F7 family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.

  - 64-Kbyte of CCM (core coupled memory) data RAM
  - LCD parallel interface, 8080/6800 modes
  - Timer with quadrature (incremental) encoder input
  - 5 V-tolerant I/Os
  - Parallel camera interface
  - True random number generator
  - RTC: subsecond accuracy, hardware calendar
  - 96-bit unique ID
      </description>
      <book name="Documentation/DM00124865.pdf" title="STM32F74xx/5xx Reference Manual"/>

      <feature type="Timer"         n="2"       m="32"/>
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="I2S"           n="2"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="Temp"          n="-40"     m="105"/>

      <!-- ************************  Subfamily 'STM32F745'  **************************** -->
      <subFamily DsubFamily="STM32F745">
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F745xx"/>
        <memory id="IRAM1" start="0x20010000" size="0x40000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000"   init="0" default="1" />
        <book name="Documentation/DM00166116.pdf" title="STM32F745/746 Data Sheet"/>

        <!-- *************************  Device 'STM32F745ZG'  ***************************** -->
        <device Dname="STM32F745ZG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745ZE'  ***************************** -->
        <device Dname="STM32F745ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745VG'  ***************************** -->
        <device Dname="STM32F745VG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745VE'  ***************************** -->
        <device Dname="STM32F745VE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745IG'  ***************************** -->
        <device Dname="STM32F745IG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F745IGKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745IE'  ***************************** -->
        <device Dname="STM32F745IE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F745IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F745IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>
 
      <!-- ************************  Subfamily 'STM32F746'  **************************** -->
      <subFamily DsubFamily="STM32F746">
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F746xx"/>
        <memory id="IRAM1" start="0x20010000" size="0x40000"    init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000"    init="0" default="1" />
        <book name="Documentation/DM00166116.pdf" title="STM32F745/746 Data Sheet"/>

        <!-- *************************  Device 'STM32F746ZG'  ***************************** -->
        <device Dname="STM32F746ZG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746ZGYx"> <feature type="CSP" n="143"/> </variant>
          <variant Dvariant="STM32F746ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746VG'  ***************************** -->
        <device Dname="STM32F746VG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746IG'  ***************************** -->
        <device Dname="STM32F746IG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746IGHx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F746IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
