HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F7xx_DFP.2.4.0.pdsc
        <!-- *************************  Device 'STM32F756ZG'  ***************************** -->
        <device Dname="STM32F756ZG">
          <variant Dvariant="STM32F756ZGYx"> <feature type="CSP" n="143"/> </variant>
          <variant Dvariant="STM32F756ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756VG'  ***************************** -->
        <device Dname="STM32F756VG">
          <variant Dvariant="STM32F756VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756IG'  ***************************** -->
        <device Dname="STM32F756IG">
          <variant Dvariant="STM32F756IGHx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F756IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756BG'  ***************************** -->
        <device Dname="STM32F756BG">
          <variant Dvariant="STM32F756BGTx"> <feature type="QFP" n="208"/> </variant>   
        </device>
        <!-- *************************  Device 'STM32F756NG'  ***************************** -->
        <device Dname="STM32F756NG">
          <variant Dvariant="STM32F756NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7">
      <description>STMicroelectronics STM32F7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F7*"/>
    </condition>

    <condition id="STM32F745">
      <description>STMicroelectronics STM32F745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F745*"/>
    </condition>
    <condition id="STM32F746">
      <description>STMicroelectronics STM32F746 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F746*"/>
    </condition>
    <condition id="STM32F756">
      <description>STMicroelectronics STM32F756 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F756*"/>
    </condition>

    <condition id="STM32F7x6">
      <description>STMicroelectronics STM32F746/756 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
    </condition>

    <condition id="STM32F7_ARMCC">
      <description>filter for STM32F7xx devices and the ARM compiler</description>
      <require condition="STM32F7"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F746_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F756_ARMCC">
      <description>filter for STM32F756 devices and the ARM compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_GCC">
      <description>filter for STM32F745 devices and the GCC compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F746_GCC">
      <description>filter for STM32F746 devices and the GCC compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F756_GCC">
      <description>filter for STM32F756 devices and the GCC compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32F745_IAR">
      <description>filter for STM32F745 devices and the IAR compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F746_IAR">
      <description>filter for STM32F746 devices and the IAR compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F756_IAR">
      <description>filter for STM32F756 devices and the IAR compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7 CMSIS">
      <description>STMicroelectronics STM32F7 Device and CMSIS-CORE</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

