HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F7xx_DFP.2.4.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.0.4" condition="STM32F7 HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_i2c_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S" Cversion="1.0.4" condition="STM32F7 HAL DMA">
      <description>I2S HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2S
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_i2s.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA" Cversion="1.0.4" condition="STM32F7 HAL DMA">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_irda.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_iwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>Low-power timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_lptim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC" Cversion="1.0.4" condition="STM32F7x6 HAL">
      <description>LCD-TFT Controller (LTDC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LTDC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_ltdc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>NAND Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NAND
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_nand.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_ll_fmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>NOR Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NOR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_nor.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_ll_fmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>USB Peripheral controller (PCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_pcd.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_pcd_ex.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_ll_usb.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_pwr_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI" Cversion="1.0.4" condition="STM32F7 HAL DMA">
      <description>Quad Serial peripheral interface (QSPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_QSPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_qspi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC" Cversion="1.0.4" condition="STM32F7 HAL GPIO">
      <description>Reset and clock control (RCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_rcc.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_rcc_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RNG" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>Random number generator (RNG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_rng.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RTC" Cversion="1.0.4" condition="STM32F7 HAL">
      <description>Real-time clock (RTC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_rtc.c"/>
        <file category="source" name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal_rtc_ex.c"/>
      </files>
    </component>

